//#include "_typedef.h"
//#include "PIC18F6622.h"
//#include "Spcinitial.h"
//#include "Spcsystem.h"

//#define testpart 1
//#define programmtest  1

//#define TEMP_RELATE 1

#define SYSTEST 1
#define SHOWOFF 1
//#define ADDITIONCALIBRATION 1

sbit LCD_RW at LATF6_bit;
sbit LCD_RW_Direction at TRISF6_bit;

sbit LCD_RS at LATF5_bit;
sbit LCD_EN at LATF7_bit;
sbit LCD_D4 at LATE4_bit;
sbit LCD_D5 at LATE5_bit;
sbit LCD_D6 at LATE6_bit;
sbit LCD_D7 at LATE7_bit;

sbit LCD_RS_Direction at TRISF5_bit;
sbit LCD_EN_Direction at TRISF7_bit;
sbit LCD_D4_Direction at TRISE4_bit;
sbit LCD_D5_Direction at TRISE5_bit;
sbit LCD_D6_Direction at TRISE6_bit;
sbit LCD_D7_Direction at TRISE7_bit;

//==============================================================================
//定义系统时钟
//==============================================================================
#define SYSTEM_CLOCK        20000000                 //20M时钟
#define SYSTEM_CLOCK_MHZ    20
#define TIME_UNIT           500                //时间片单位500US
#define TMRVAL              65535-TIME_UNIT*SYSTEM_CLOCK_MHZ/4   //定时调整值

#define DELAY_S             5000               //秒计时
#define DELAY_M             60                 //分计时
#define DELAY_H             60                 //小时计时
#define DELAY_D             24                 //天计时

#define DELAY_VT            10                 //电压测量时间间隔，10秒
#define DELAY_TEMP          10                 //温度测量时间间隔，10秒


#define CALIBRATE_RTDB_50_STR  36
#define CALIBRATE_RTDB_500_STR  37

#define CALIBRATING_STR 38
#define BLANK_STR 39

#define RTD_SHORT_STR 40
#define RTD_OPEN_STR 41
#define OUTOFRANGE_STR 42

#define VERSION_TITLE_STR 43
#define VERSION_CONTENT_STR 44

#define CALI_RTDA_50     0
#define CALI_RTDA_500    1
#define CALI_RTDB_50     2
#define CALI_RTDB_500    3

//Alarms显示信息位置
#define CH1_ALARM_LOWTEMP_STR  43
#define CH2_ALARM_LOWTEMP_STR  44
#define CH1_ALARM_HIGTEMP_STR  45
#define CH2_ALARM_HIGTEMP_STR  46
#define CH1_ALARM_LOWCURRENT_STR  47
#define CH2_ALARM_LOWCURRENT_STR  48
#define CH1_ALARM_HIGHCURRENT_STR  49
#define CH2_ALARM_HIGHCURRENT_STR  50
#define CH1_ALARM_GFI_STR  51
#define CH2_ALARM_GFI_STR  52
#define CH1_ALARM_GFITRIP_STR  53
#define CH2_ALARM_GFITRIP_STR  54
#define ALARM_LOWVOLT_STR  55
#define ALARM_HIGHVOLT_STR  56
#define CH1_ALARM_CONTINUEFAIL_STR  57
#define CH2_ALARM_CONTINUEFAIL_STR  58
#define CH1_ALARM_SWITCHFAIL_STR  59
#define CH2_ALARM_SWITCHFAIL_STR  60
#define CH1_ALARM_RTDAOPEN_STR  61
#define CH2_ALARM_RTDAOPEN_STR  62
#define CH1_ALARM_RTDASHORT_STR  63
#define CH2_ALARM_RTDASHORT_STR  64
#define CH1_ALARM_RTDBOPEN_STR  65
#define CH2_ALARM_RTDBOPEN_STR  66
#define CH1_ALARM_RTDBSHORT_STR  67
#define CH2_ALARM_RTDBSHORT_STR  68
#define CH1_ALARM_GFITESTFAIL_STR  69
#define CH2_ALARM_GFITESTFAIL_STR  70


#define ALARM_SELFCHECKFAIL_STR  71
#define ALARM_AUTOTEST_STR  72


//off/none显示信息位置
#define NO_STR  4
#define YES_STR  5
#define OFF_STR  73
#define ON_STR  74
#define NONE_STR  75
#define COUNTINU_STR 76
#define DISABLE_STR 77
          #define ON_OFF_STR OFF_STR

//密码显示信息位置
#define DEFAULT_PSW_STR  78
#define ENTER_PSW_STR  79
#define RESET_REQ_PSW_STR  80
#define RESET_SUCCESS_PSW_STR  81
#define RESET_FAILT_PSW_STR  82

//存储显示信息位置
#define STORE_STR  83

//RESET STATISTICS
#define CONFIRM_CHANGE_STR 84
#define CHANGE_COMPLETE_STR 85

//default display information
#define DEFAULT_HEATERTEMP_STR  86
#define DEFAULT_HEATERSTATUS_STR  87
#define DEFAULT_SYSTEMSTATUS_STR  88

//blank value
#define NONEVALUE_STR  89

//calibration and testing display
#define NEED_CALIBRATION_STR  90
#define NOW_CALIBRATION_STR  91
#define FINISH_CALIBRATION_STR  92

#define NEED_TESTING_STR  93
#define NOW_TESTING_STR  94
#define FINISH_TESTING_STR  95

//channel config
#define CHANNEL1_STR  96
#define CHANNEL2_STR  97


//SSR强制操作命令
#define FORCE_LEVEL_LOW  0
#define FORCE_LEVEL_MID  1
#define FORCE_LEVEL_HIGH  2

#define GFITRIPFORCEOFF  0x01
#define HIGHTEMPCUTOFFFORCEOFF  0x02
#define FAILUREMODEFORCEOFF  0x04
#define MANUALFORCEOFF  0x08
#define HEATERDISABLEFORCEOFF  0x10

#define GFITESTFORCEON       0x01
#define HEATERTESTFORCEON    0x02
#define AUTOTESTFORCEON      0x04
#define FAILUREMODEFORCEON   0x08

typedef unsigned char UCHAR;
typedef unsigned int UINT;
typedef unsigned long ULONG;

typedef struct tagUCHAR_BIT
{
  UCHAR bit0:1;
  UCHAR bit1:1;
  UCHAR bit2:1;
  UCHAR bit3:1;
  UCHAR bit4:1;
  UCHAR bit5:1;
  UCHAR bit6:1;
  UCHAR bit7:1;
}UCHAR_BIT;

typedef union tagUCHAR_BYTE
{
  UCHAR byte;
  UCHAR_BIT bite;
}UCHAR_BYTE;

typedef union tagUINT16
{
  UCHAR byte[2];
  UINT  word;
}UINT16;

typedef union tagUINT32
{
  UCHAR byte[4];
  UINT  inte[2];
  ULONG word;
}UINT32;

typedef struct tagSPCTRING
{
  UCHAR SPCtring[20];
}SPCTRING;

typedef struct tagSYSTEM_FLAG_INT
{
  ULONG keypushed:1;
  ULONG meas_VT_reach:2;
  ULONG freq_en:1;
  ULONG lcd_line1_needupdate:1;
  ULONG lcd_line2_needupdate:1;
  ULONG mainmenuroll:1;
  ULONG alarm_displayed:1;     //正在显示ALARM
  ULONG alarm_actived:1;       //有ALARM存在
  ULONG log_displayed:1;
  ULONG default_diaped:1;
  ULONG char_actived:1;
  ULONG modebus_rx:1;
  ULONG scantime_en:2;         //enable scantime
  ULONG flashing_en:1;
  ULONG flashing_reach:1;
  ULONG flashing_state:1;
  ULONG temp_err:1;
  ULONG temp_update:1;
  ULONG load_forceop:2;    //1:强制打开 0：强制关闭
  ULONG alarmssr_forceop:1;
  ULONG alarmssr_stat:1;
  ULONG alarmtest_cmd:2;
  ULONG heatest_reach:1;
  ULONG heatest_req:1;
  ULONG autotest_req:2;
  ULONG char_flash:1;
  ULONG stat_update:1;
}SYSTEM_FLAG_INT;

typedef union tagSYSTEM_FLAG
{
  ULONG word;
  SYSTEM_FLAG_INT bite;
}SYSTEM_FLAG;

typedef struct tagTEMPERATURE
{
  int Temperature_F;
  int Temperature_C;
}TEMPERATURE;

typedef struct tagSYSTEM_VALUE_SHORT
{

//SPC设置参数
  ULONG spc_units_c:1;          //UNITS                                         0
  ULONG heater_en:1;           //                                               1
  ULONG man_on:1;             //0:禁止手动控制  1:使能手动控制                  2
  ULONG ctl_type:1;              //Control type  0:on/off  1:proportional       3
  ULONG rtd_opr:3;            //rtd operation                                   4
                             //    0:one rtd  1:backup  2:average
                             //    3:lowest   4:highest 5:high temp cutoff
  ULONG rtd_fail_mod:1;       //  0:off                                         7
  ULONG password_en:1;        //                                                8
  ULONG usr_advanced:1;        //                                               9
  ULONG def_display:2;         //default display  0:system status               10
                                 //  1:heater status  2:heater temp
  ULONG baud:3;                 //                                              12
  ULONG gfi_test_mod:2;        //GFI test mode   0:atuo cycle                   15
                               //     1:now  2:Disable
  ULONG heater_type:1;         //heater type    0:fix resister heater           17
                               //               1:self regulater heater
  ULONG cable_type:1;         //0:fix resistor  1:self regulate                 18
  ULONG reservd:13;
}SYSTEM_VALUE_SHORT;

typedef union tagSYSTEM_VALUEB
{
  ULONG word;
  SYSTEM_VALUE_SHORT bite;
}SYSTEM_VALUEB;

typedef struct tagSPCSETPIONTS
{
//Set points
  TEMPERATURE   MaintainTemp;          //0
  TEMPERATURE   LowTemp;               //4
  TEMPERATURE   HighTemp;              //8
  TEMPERATURE   DeadBand;              //12
  
  int   LowCurrent;                    //16
  int   HighCurrent;                   //18

  int   GFIAlarm;                      //20
  int   GFITrip;                       //22

  int   LowVoltage;                    //24
  int   HighVoltage;                   //26


  int   LimitedCurrent;                //28

  int   SoftStartTime;                 //30
  int   AutoTestTime;                  //32

  int   DisplayTime;                   //34

  int  CostPerKWH;                     //36
  int  ScanSpeed;                       //38
  int  ModbusAdd;                       //40
  int  BaudRate;                        //42
  
  int   AlarmOutTest;                   //44
  int   HeaterTest;                     //46
  int   GFTest;                         //48

  char    HeaterName[16];               //50
  char    Password[16];                 //66
  char    CharacNum;     //表示正在输入第几个字符        82
  char    StringNum;     //字符轮转计数                 83

  SYSTEM_VALUEB system_valueb;  //系统短数据             84
}SPCSETPIONTS;

typedef struct tagSTATISTICS
{
//Statistics
  TEMPERATURE   MaximumTemp;      //12
  TEMPERATURE   MinimumTemp;      //14
  int   MaximumCurrent;           //16
  int   MaximumGFCurrent;         //17
  int   MaximumVoltage;           //18
  int   MinimumVoltage;           //19
  int   EnergyUsed;               //20
  ULONG EnergyCost;               //21
  ULONG RunTime;                  //22
  int   HeaterOnTime;             //24
  int   Version;                  //25
}STATISTICS;

typedef struct tagSPCACTUAL
{
//Actual
  TEMPERATURE   Temperature;  //0
  TEMPERATURE   TemperatureA;   //2
  TEMPERATURE   TemperatureB;  //4
  int   HeaterPow;             //6
  int   Current;               //7
  int   Current_RMS;           //8
  int   GFICurrent;            //9
  int   Voltage;               //10
  int   HeaterStatus;          //11
}SPCACTUAL;

typedef struct tagSPCVALUE
{
  SPCACTUAL SPCActual;
  STATISTICS SPCStatistics;
  SPCSETPIONTS SPCSetPoints;
} SPCVALUE;

typedef struct tagSPCMENUFLAG_BIT
{
  UCHAR menu_active:1;
  UCHAR advanced_req:1;
  UCHAR maintainnone_conflict:1;
  UCHAR maintainoff_conflict:1;
  UCHAR proportional_conflict:1;
  UCHAR SelfRegula_conflict:1;
  UCHAR FoxResis_conflict:1;
  UCHAR reservd:1;
}SPCMENUFLAG_BIT;

typedef union tagSPCMENUFLAG
{
  UCHAR word;
  SPCMENUFLAG_BIT bite;
}SPCMENUFLAG;

typedef struct tagSPCCOUNT
{
  unsigned int secout;         //conter for 1second
  unsigned int toutT;         //counter for timeout
  unsigned int Timeout_count;
  unsigned int modbus_count;  //modbus end check
  unsigned int scanT;         //scan time
  char meas_VT_count;         //Vlot & Temp measure counter
  char meas_CG_count[2];         //Current & GFI measure counter
  unsigned int freq_count;
